app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quiz"], ["description", "asdfasdf"], ["created_at", "2015-12-31 19:45:03.614973"], ["updated_at", "2015-12-31 19:45:03.614973"]]
---
  def create
    # Create a new Post instance
    @post = Post.new
    # Pass in the parameters from the form
    @post.title = params[:title]
    @post.description = params[:description]
    # Save the record
    @post.save